uhnp/src/Documents/ОповещениеАккредитованныхПоставщиковОТоргах/ОповещениеАккредитованныхПоставщиковОТоргах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОповещениеАккредитованныхПоставщиковОТоргах</name>
  <basedOn>Catalog.ЗакупочныеПроцедуры</basedOn>
  <attributes>
    <name>ЗакупочнаяПроцедура</name>
    <type>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЛот</name>
    <type>
      <types>CatalogRef.Лоты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Поставщики</name>
    <attributes>
      <name>АнкетаПоставщика</name>
      <type>
        <types>CatalogRef.АнкетыПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аккредитован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещениеОтправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/ОповещениеАккредитованныхПоставщиковОТоргах/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОповещениеАккредитованныхПоставщиковОТоргах.Поставщики КАК ТабПоставщики
	|	ПО ЭтотСписок.Ссылка = ТабПоставщики.Ссылка 
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК СпрВнешПользователи 
	|    ПО СпрВнешПользователи.ОбъектАвторизации = ТабПоставщики.АнкетаПоставщика 
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|    ЗначениеРазрешено(СпрВнешПользователи.Ссылка)";

	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

	
// Для контроля дублирования документов с одинаковыми
// ключевыми полями.
//
Функция ПолучитьАналогичныйДокумент(ДокументОбъект) Экспорт
	Если ЗначениеЗаполнено(ДокументОбъект.Ссылка) Тогда
		ИсключитьСсылку = ДокументОбъект.Ссылка;
	Иначе
		ИсключитьСсылку = Неопределено;
	КонецЕсли;
	мДокументов =
		ЦентрализованныеЗакупкиУХ.ПолучитьДокументыПоОтбору(
			"ОповещениеАккредитованныхПоставщиковОТоргах",
			Новый Структура(
				"ЗакупочнаяПроцедура, ПометкаУдаления",
				ДокументОбъект.ЗакупочнаяПроцедура, Ложь),
			ИсключитьСсылку);
	Если мДокументов.Количество() = 0 Тогда
		Возврат Документы.ОповещениеАккредитованныхПоставщиковОТоргах.ПустаяСсылка();
	КонецЕсли;
	Возврат мДокументов[0];
КонецФункции


#КонецЕсли
